{"class_name": "Functional", "config": {"name": "model_120", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 55, 300], "dtype": "float64", "sparse": false, "ragged": false, "name": "INPUT"}, "name": "INPUT", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"name": "CNN1", "trainable": true, "dtype": "float32", "filters": 175, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "CNN1", "inbound_nodes": [[["INPUT", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "CNN2", "trainable": true, "dtype": "float32", "filters": 175, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "CNN2", "inbound_nodes": [[["INPUT", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "CNN3", "trainable": true, "dtype": "float32", "filters": 175, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "CNN3", "inbound_nodes": [[["INPUT", 0, 0, {}]]]}, {"class_name": "SpatialDropout1D", "config": {"name": "SPATIAL_DROPOUT_1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "SPATIAL_DROPOUT_1", "inbound_nodes": [[["CNN1", 0, 0, {}]]]}, {"class_name": "SpatialDropout1D", "config": {"name": "SPATIAL_DROPOUT_2", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "SPATIAL_DROPOUT_2", "inbound_nodes": [[["CNN2", 0, 0, {}]]]}, {"class_name": "SpatialDropout1D", "config": {"name": "SPATIAL_DROPOUT_3", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "SPATIAL_DROPOUT_3", "inbound_nodes": [[["CNN3", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "MAX_POOL_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "MAX_POOL_1", "inbound_nodes": [[["SPATIAL_DROPOUT_1", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "MAX_POOL_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "MAX_POOL_2", "inbound_nodes": [[["SPATIAL_DROPOUT_2", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "MAX_POOL_3", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "MAX_POOL_3", "inbound_nodes": [[["SPATIAL_DROPOUT_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "CONCATENATE", "trainable": true, "dtype": "float32", "axis": 1}, "name": "CONCATENATE", "inbound_nodes": [[["MAX_POOL_1", 0, 0, {}], ["MAX_POOL_2", 0, 0, {}], ["MAX_POOL_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "DL_1", "trainable": true, "dtype": "float32", "units": 300, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "DL_1", "inbound_nodes": [[["CONCATENATE", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "DENSE_DROP_1", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "DENSE_DROP_1", "inbound_nodes": [[["DL_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "DL_2", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "DL_2", "inbound_nodes": [[["DENSE_DROP_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "DENSE_DROP_2", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "DENSE_DROP_2", "inbound_nodes": [[["DL_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "PREDICTOR", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "PREDICTOR", "inbound_nodes": [[["DENSE_DROP_2", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_120", "trainable": true, "dtype": "float32", "target_shape": [5]}, "name": "reshape_120", "inbound_nodes": [[["PREDICTOR", 0, 0, {}]]]}], "input_layers": [["INPUT", 0, 0]], "output_layers": [["reshape_120", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}